// написать программу которая из имеющегося массива строк формирует массив из строк,
// длинна которых меньше либо равна 3 символа

void PrintArray(string[] array)
{
  for(int i = 0; i < array.Length; i++)
  {System.Console.Write(array[i] + ", ");}
}



